app/Models/UsuarioModel.php

    public function session_valid($usuario,$clave){
        return $this->db->table('usuario u')
        ->join('perfil pe', 'u.idperfil_usuario=pe.id_perfil')
        ->where(["u.estado" => '1', "u.usuario" => $usuario,"u.clave" => $clave, 'pe.estadoperfil' => '1'])
        ->get()->getResultArray();
---
SELECT *
FROM `usuario` `u`
JOIN `perfil` `pe` ON `u`.`idperfil_usuario`=`pe`.`id_perfil`
WHERE `u`.`estado` = '1'
AND `u`.`usuario` = '76151674'
AND `u`.`clave` = '$2a$07$asxx54ahjppf45sd87a5aua5eRVf56/8V1YAqTOXmeTrW6EU.D5MK'
AND `pe`.`estadoperfil` = '1'

	public function get_mod($id_perfil){
		return $this->db->table('permiso p')
		->join('modulo m', 'm.id_modulo=p.idmodulo')
		->where(['p.idperfilpermiso' => $id_perfil])
		->get()->getResultArray();
---
SELECT *
FROM `permiso` `p`
JOIN `modulo` `m` ON `m`.`id_modulo`=`p`.`idmodulo`
WHERE `p`.`idperfilpermiso` = '1'